tap 'boz/repo'
tap 'derailed/k9s'
tap 'hashicorp/tap'
tap 'johanhaleby/kubetail'
tap 'ktr0731/evans'
tap 'wez/wezterm'

# Taps for tools
brew 'kubetail'
brew 'evans'
brew 'terraform-ls'
cask 'wezterm'
brew 'gum'

# GNU & Utilities
brew 'autoconf'
brew 'binutils'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnupg'
brew 'gnutls'
brew 'grep'
brew 'libpq'
brew 'make'
brew 'nkf'
brew 'openssl'
brew 'readline'
brew 'source-highlight'
brew 'tree'
brew 'wget'

# Shell & Terminal
brew 'fzf'
brew 'ripgrep'
brew 'sheldon'
brew 'shellcheck'
brew 'starship'

# Git & Version Control
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'lazygit'

# Cloud & DevOps
brew 'awscli'
brew 'docker'
brew 'istioctl'
brew 'k9s'
brew 'krew'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'sops'

# Languages & Runtimes
brew 'cocoapods'
brew 'mise'
brew 'postgresql'
brew 'protobuf'

# LSPs
brew 'bash-language-server'
brew 'dockerfile-language-server'
brew 'solargraph'
brew 'taplo'
brew 'vscode-langservers-extracted'
brew 'yaml-language-server'

# AI
brew 'copilot-cli'
brew 'ollama'

# Other
brew 'grip'
brew 'imagemagick'
brew 'nmap'

# Casks
cask '1password-cli'
cask 'android-studio'
cask 'caffeine'
cask 'chatgpt'
cask 'claude'
cask 'cursor'
cask 'cyberduck'
cask 'dbeaver-community'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'licecap'
cask 'notion'
cask 'notion-calendar'
cask 'notion-mail'
cask 'obsidian'
cask 'raycast'
cask 'slack'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-monaspace'

# Mas
if ENV['CI'] != 'true'
  mas 'LINE', id: 539883307
  mas 'Keynote', id: 409183694
  mas 'WinArchiver', id: 414855915
end

# VSCode Extensions
vscode 'anysphere.cursorpyright'
vscode 'anysphere.remote-containers'
vscode 'astro-build.astro-vscode'
vscode 'bierner.markdown-preview-github-styles'
vscode 'bradlc.vscode-tailwindcss'
vscode 'bung87.vscode-gemfile'
vscode 'charliermarsh.ruff'
vscode 'coderabbit.coderabbit-vscode'
vscode 'dart-code.dart-code'
vscode 'dart-code.flutter'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'esbenp.prettier-vscode'
vscode 'foxundermoon.shell-format'
vscode 'github.vscode-github-actions'
vscode 'github.vscode-pull-request-github'
vscode 'golang.go'
vscode 'graphql.vscode-graphql-syntax'
vscode 'hashicorp.terraform'
vscode 'hverlin.mise-vscode'
vscode 'idleberg.nsis'
vscode 'imgildev.vscode-drizzle-snippets'
vscode 'jeroen-meijer.pubspec-assist'
vscode 'karunamurti.haml'
vscode 'llvm-vs-code-extensions.lldb-dap'
vscode 'matangover.mypy'
vscode 'mechatroner.rainbow-csv'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-ceintl.vscode-language-pack-ja'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.debugpy'
vscode 'ms-python.mypy-type-checker'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-vscode.makefile-tools'
vscode 'njpwerner.autodocstring'
vscode 'octref.vetur'
vscode 'prisma.prisma'
vscode 'rebornix.ruby'
vscode 'redhat.java'
vscode 'redhat.vscode-yaml'
vscode 'remcohaszing.schemastore'
vscode 'rphlmr.vscode-drizzle-orm'
vscode 'rubocop.vscode-rubocop'
vscode 'shopify.ruby-lsp'
vscode 'sorbet.sorbet-vscode-extension'
vscode 'tamasfe.even-better-toml'
vscode 'timonwong.shellcheck'
vscode 'vadimcn.vscode-lldb'
vscode 'vscjava.vscode-gradle'
vscode 'vscjava.vscode-java-debug'
vscode 'vscjava.vscode-java-dependency'
vscode 'vscjava.vscode-java-pack'
vscode 'vscjava.vscode-java-test'
vscode 'vscjava.vscode-maven'
vscode 'wingrunr21.vscode-ruby'
