tap 'boz/repo'
tap 'dart-lang/dart'
tap 'derailed/k9s'
tap 'getsentry/tools'
tap 'golangci/tap'
tap 'hashicorp/tap'
tap 'jesseduffield/lazydocker'
tap 'jesseduffield/lazygit'
tap 'johanhaleby/kubetail'
tap 'ktr0731/evans'
tap 'leoafarias/fvm'
tap 'oven-sh/bun'
tap 'wez/wezterm'

# Taps for tools
brew 'boz/repo/kail'
brew 'derailed/k9s/k9s'
brew 'getsentry/tools/sentry-wizard'
brew 'golangci/tap/golangci-lint'
brew 'hashicorp/tap/terraform-ls'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'johanhaleby/kubetail/kubetail'
brew 'ktr0731/evans/evans'
brew 'leoafarias/fvm/fvm'
brew 'oven-sh/bun/bun'
brew 'gum'

# GNU & Utilities
brew 'autoconf'
brew 'binutils'
brew 'cairo'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gettext'
brew 'giflib'
brew 'gmp'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnupg'
brew 'gnutls'
brew 'grep'
brew 'imagemagick'
brew 'jpeg'
brew 'lhasa'
brew 'libpng'
brew 'libpq'
brew 'librsvg'
brew 'libyaml'
brew 'make'
brew 'nkf'
brew 'openssl@3'
brew 'pango'
brew 'pixman'
brew 'pkgconf'
brew 'source-highlight'
brew 'tree'
brew 'vips'
brew 'wget'

# Shell & Terminal
brew 'ast-grep'
brew 'direnv'
brew 'fzf'
brew 'sheldon'
brew 'starship'

# Editors
brew 'helix'

# Git & Version Control
brew 'diff-so-fancy'
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'lazygit'

# Cloud & DevOps
brew 'argocd'
brew 'awscli'
brew 'azure-cli'
brew 'cloudflared'
brew 'docker', link: false
brew 'hadolint'
brew 'helm'
brew 'heroku'
brew 'istioctl'
brew 'krew'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kubeseal'
brew 'minio-mc'
brew 'sops'
brew 'tflint'

# Languages & Runtimes
brew 'cocoapods'
brew 'lua'
brew 'mise'
brew 'mysql-client'
brew 'protobuf'
brew 'uv'

# Mobile Development
brew 'fastlane'
brew 'firebase-cli'

# AI Tools
brew 'gemini-cli'

# LSPs
brew 'bash-language-server'
brew 'dockerfile-language-server'
brew 'yaml-language-server'

# Alternatives to classic CLI
brew 'bat' # cat
brew 'bottom' # top
brew 'fx' # jq viewer
brew 'jq'
brew 'q' # dig
brew 'ripgrep' # grep
brew 'tldr' # man

# Other
brew 'ghidra', link: false
brew 'grip'
brew 'mas'
brew 'nmap'

# Casks
cask '1password-cli'
cask 'android-studio'
cask 'claude'
cask 'claude-code'
cask 'cursor'
cask 'cyberduck'
cask 'dbeaver-community'
cask 'discord'
cask 'docker-desktop'
cask 'firefox'
cask 'flutter'
cask 'gcloud-cli'
cask 'ghidra'
cask 'google-chrome'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'licecap'
cask 'netron'
cask 'notion'
cask 'notion-calendar'
cask 'notion-mail'
cask 'orbstack'
cask 'raycast'
cask 'slack'
cask 'wezterm@nightly'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-monaspace'

# Mas
if ENV['CI'] != 'true'
  mas 'Keynote', id: 409183694
  mas 'Kindle', id: 302584613
  mas 'LINE', id: 539883307
end

# Cursor Extensions
vscode 'anysphere.cursorpyright'
vscode 'anysphere.remote-containers'
vscode 'astro-build.astro-vscode'
vscode 'bierner.markdown-preview-github-styles'
vscode 'bradlc.vscode-tailwindcss'
vscode 'bung87.vscode-gemfile'
vscode 'charliermarsh.ruff'
vscode 'coderabbit.coderabbit-vscode'
vscode 'dart-code.dart-code'
vscode 'dart-code.flutter'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'editorconfig.editorconfig'
vscode 'esbenp.prettier-vscode'
vscode 'foxundermoon.shell-format'
vscode 'github.vscode-github-actions'
vscode 'github.vscode-pull-request-github'
vscode 'golang.go'
vscode 'graphql.vscode-graphql-syntax'
vscode 'hashicorp.terraform'
vscode 'hverlin.mise-vscode'
vscode 'idleberg.nsis'
vscode 'imgildev.vscode-drizzle-snippets'
vscode 'jeroen-meijer.pubspec-assist'
vscode 'karunamurti.haml'
vscode 'llvm-vs-code-extensions.lldb-dap'
vscode 'matangover.mypy'
vscode 'mechatroner.rainbow-csv'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-ceintl.vscode-language-pack-ja'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.debugpy'
vscode 'ms-python.mypy-type-checker'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-vscode.makefile-tools'
vscode 'njpwerner.autodocstring'
vscode 'octref.vetur'
vscode 'prisma.prisma'
vscode 'rebornix.ruby'
vscode 'redhat.java'
vscode 'redhat.vscode-yaml'
vscode 'remcohaszing.schemastore'
vscode 'rphlmr.vscode-drizzle-orm'
vscode 'rubocop.vscode-rubocop'
vscode 'shopify.ruby-lsp'
vscode 'sorbet.sorbet-vscode-extension'
vscode 'tamasfe.even-better-toml'
vscode 'timonwong.shellcheck'
vscode 'vadimcn.vscode-lldb'
vscode 'vscjava.vscode-gradle'
vscode 'vscjava.vscode-java-debug'
vscode 'vscjava.vscode-java-dependency'
vscode 'vscjava.vscode-java-pack'
vscode 'vscjava.vscode-java-test'
vscode 'vscjava.vscode-maven'
vscode 'wingrunr21.vscode-ruby'
