tap 'boz/repo'
tap 'derailed/k9s'
tap 'hashicorp/tap'
tap 'johanhaleby/kubetail'
tap 'ktr0731/evans'
tap 'wez/wezterm'

# Taps for tools
brew 'kubetail'
brew 'evans'
brew 'terraform-ls'
cask 'wezterm'
brew 'gum'

# GNU & Utilities
brew 'autoconf'
brew 'binutils'
brew 'cmake'
brew 'coreutils'
brew 'curl'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnupg'
brew 'gnutls'
brew 'grep'
brew 'libpq'
brew 'make'
brew 'nkf'
brew 'openssl'
brew 'readline'
brew 'source-highlight'
brew 'tree'
brew 'wget'

# Shell & Terminal
brew 'fzf'
brew 'ripgrep'
brew 'sheldon'
brew 'shellcheck'
brew 'starship'
brew 'terminal-notifier'

# Git & Version Control
brew 'gh'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'lazygit'

# Cloud & DevOps
brew 'awscli'
brew 'docker'
brew 'istioctl'
brew 'k9s'
brew 'krew'
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'sops'

# Languages & Runtimes
brew 'cocoapods'
brew 'mise'
brew 'openjdk'
brew 'postgresql'
brew 'protobuf'

# LSPs
brew 'bash-language-server'
brew 'dockerfile-language-server'
brew 'solargraph'
brew 'taplo'
brew 'vscode-langservers-extracted'
brew 'yaml-language-server'

# Other
brew 'grip'
brew 'imagemagick'
brew 'nmap'

# Casks
cask '1password-cli'
cask 'android-studio'
cask 'caffeine'
cask 'chatgpt'
cask 'claude'
cask 'cursor'
cask 'cyberduck'
cask 'dbeaver-community'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'jordanbaird-ice'
cask 'karabiner-elements'
cask 'licecap'
cask 'notion'
cask 'notion-calendar'
cask 'notion-mail'
cask 'obsidian'
cask 'raycast'
cask 'slack'

# Fonts
cask 'font-hack-nerd-font'
cask 'font-monaspace'

# Mas
if ENV['CI'] != 'true'
  mas 'LINE', id: 539883307
  mas 'Keynote', id: 409183694
  mas 'WinArchiver', id: 414855915
end

# VSCode Extensions
vscode 'anysphere.pyright'
vscode 'Dart-Code.dart-code'
vscode 'Dart-Code.flutter'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'EditorConfig.EditorConfig'
vscode 'esbenp.prettier-vscode'
vscode 'golang.go'
vscode 'idleberg.nsis'
vscode 'ms-azuretools.vscode-docker'
vscode 'MS-CEINTL.vscode-language-pack-ja'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'redhat.vscode-yaml'
vscode 'tamasfe.even-better-toml'
vscode 'XadillaX.viml'
